espressif/arduino-esp32/libraries/WebServer/src/WebServer.cpp
/*
  WebServer.cpp - Dead simple web-server.
  Supports only one simultaneous client, knows how to handle GET and POST.

  Copyright (c) 2014 Ivan Grokhotkov. All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
  Modified 8 May 2015 by Hristo Gochkov (proper post and file upload handling)
*/


#include <Arduino.h>
#include <esp32-hal-log.h>
#include <libb64/cdecode.h>
#include <libb64/cencode.h>
#include "esp_random.h"
#include "WiFiServer.h"
#include "WiFiClient.h"
#include "WebServer.h"
#include "HEXBuilder.h"
#include "FS.h"
#include "detail/RequestHandlersImpl.h"
#include "MD5Builder.h"
#include "mbedtls/sha1.h"
#include "mbedtls/base64.h"

static const char AUTHORIZATION_HEADER[] = "Authorization";
static const char qop_auth[] PROGMEM = "qop=auth";
static const char qop_auth_quoted[] PROGMEM = "qop=\"auth\"";
static const char WWW_Authenticate[] = "WWW-Authenticate";
static const char Content_Length[] = "Content-Length";
static const char ETAG_HEADER[] = "If-None-Match";


WebServer::WebServer(IPAddress addr, int port)
: _corsEnabled(false)
, _server(addr, port)
, _currentMethod(HTTP_ANY)
, _currentVersion(0)
, _currentStatus(HC_NONE)
, _statusChange(0)
, _nullDelay(true)
, _currentHandler(nullptr)
, _firstHandler(nullptr)
, _lastHandler(nullptr)
, _currentArgCount(0)
, _currentArgs(nullptr)
, _postArgsLen(0)
, _postArgs(nullptr)
, _headerKeysCount(0)
, _currentHeaders(nullptr)
, _contentLength(0)
, _clientContentLength(0)
, _chunked(false)
{
  log_v("WebServer::Webserver(addr=%s, port=%d)", addr.toString().c_str(), port);
}

WebServer::WebServer(int port)
: _corsEnabled(false)
, _server(port)
, _currentMethod(HTTP_ANY)
, _currentVersion(0)
, _currentStatus(HC_NONE)
, _statusChange(0)
, _nullDelay(true)
, _currentHandler(nullptr)
, _firstHandler(nullptr)
, _lastHandler(nullptr)
, _currentArgCount(0)
, _currentArgs(nullptr)
, _postArgsLen(0)
, _postArgs(nullptr)
, _headerKeysCount(0)
, _currentHeaders(nullptr)
, _contentLength(0)
, _clientContentLength(0)
, _chunked(false)
{
  log_v("WebServer::Webserver(port=%d)", port);
}

WebServer::~WebServer() {
  _server.close();
  if (_currentHeaders)
    delete[]_currentHeaders;
  RequestHandler* handler = _firstHandler;
  while (handler) {
    RequestHandler* next = handler->next();
    delete handler;
    handler = next;
  }
}

void WebServer::begin() {
  close();
  _server.begin();
  _server.setNoDelay(true);
}

void WebServer::begin(uint16_t port) {
  close();
  _server.begin(port);
  _server.setNoDelay(true);
}

String WebServer::_extractParam(String& authReq,const String& param,const char delimit){
  int _begin = authReq.indexOf(param);
  if (_begin == -1)
    return "";
  return authReq.substring(_begin+param.length(),authReq.indexOf(delimit,_begin+param.length()));
}

static String md5str(String &in){
  MD5Builder md5 = MD5Builder();
  md5.begin();
  md5.add(in);
  md5.calculate();
  return md5.toString();
}

bool WebServer::authenticateBasicSHA1(const char * _username, const char * _sha1Base64orHex) {
	return WebServer::authenticate([_username,_sha1Base64orHex](HTTPAuthMethod mode, String username, String params[]) -> String * {
            // rather than work on a password to compare with; we take the sha1 of the
            // password received over the wire and compare that to the base64 encoded
            // sha1 passed as _sha1base64. That way there is no need to have a
            // plaintext password in the code/binary (though note that SHA1 is well
            // past its retirement age). When that matches - we `cheat' by returning
            // the password we got in the first place; so the normal BasicAuth
            // can be completed. Note that this cannot work for a digest auth -
            // as there the password in the clear is part of the calculation.
            uint8_t sha1[20];
            char sha1calc[48]; // large enough for base64 and Hex represenation
            size_t olen = 0;
            int ret = 0;

            mbedtls_sha1((const uint8_t*) params[0].c_str(),params[0].length(),sha1);

            // we can either decode _sha1base64orHex and then compare the 20 bytes;
            // or encode the sha we calculated. We pick the latter as encoding of a
            // fixed array of 20 bytes s safer than operating on something external.
            //
            #define _H2D(x) (((x)>='0' && ((x) <='9')) ? ((x)-'0') : (((x)>='a' && (x)<='f') ? ((x)-'a'+10) : 0))
            #define H2D(x) (_H2D(tolower((x))))
            if (strlen(_sha1Base64orHex) == 20 * 2) {
                HEXBuilder::bytes2hex(sha1calc,sizeof(sha1calc),sha1,sizeof(sha1));
            } else {
                ret = mbedtls_base64_encode((uint8_t*)sha1calc, sizeof(sha1calc), &olen, sha1, sizeof(sha1));
            }

            return ((username.equalsConstantTime(_username)) &&
                    (String((char*)sha1calc).equalsConstantTime(_sha1Base64orHex)) &&
                    (ret == 0) &&
                    (mode == BASIC_AUTH) /* to keep things somewhat time constant. */
                   ) ? new String(params[0]) : NULL;
        });
}

bool WebServer::authenticate(const char * _username, const char * _password){
	return WebServer::authenticate([_username,_password](HTTPAuthMethod mode, String username, String params[]) -> String * {
            return username.equalsConstantTime(_username) ? new String(_password) : NULL;
        });
}

bool WebServer::authenticate(THandlerFunctionAuthCheck fn) {
  if(!hasHeader(FPSTR(AUTHORIZATION_HEADER)))
    return false;

  String authReq = header(FPSTR(AUTHORIZATION_HEADER));
  if(authReq.startsWith(AuthTypeBasic)) {
    bool ret = false;

    authReq = authReq.substring(6); // length of AuthTypeBasic including the space at the end.
    authReq.trim();

    /* base64 encoded string is always shorter (or equal) in length */
    char *decoded = (authReq.length() < HTTP_MAX_BASIC_AUTH_LEN) ? new char[authReq.length()] : NULL;
    if (decoded) {
      char * p;
      if (base64_decode_chars(authReq.c_str(), authReq.length(), decoded) && (p = index(decoded,':')) && p) {
          authReq = "";
          /* Note: rfc7617 guarantees that there will not be an escaped colon in the username itself.
           * Note:  base64_decode_chars() guarantees a terminating \0
           */
	  *p = '\0';
          char * _username = decoded, *_password = p+1;
          String params[] = { _password, _srealm };
          String * password = fn(BASIC_AUTH, _username, params);
          if (password) {
               ret = password->equalsConstantTime(_password);
               // we're more concerned about the password; as the attacker already
               // knows the _pasword. Arduino's string handling is simple; it reallocs
               // even when smaller; so a memset is enough (no capacity/size).
               memset((void*)password->c_str(),0,password->length());
               delete password;
          };
      };
      delete[] decoded;
    };
    authReq = "";
    return ret;
  } else if(authReq.startsWith(AuthTypeDigest)) {
    authReq = authReq.substring(7);
    log_v("%s", authReq.c_str());

    // extracting required parameters for RFC 2069 simpler Digest
    //
    String _username = _extractParam(authReq,F("username=\""),'\"');
    String _realm    = _extractParam(authReq, F("realm=\""),'\"');
    String _uri      = _extractParam(authReq, F("uri=\""),'\"');
    if (!_username.length())
      goto exf;

    String params[] = { _realm, _uri };
    String * password = fn(DIGEST_AUTH,_username, params);
    if(!password)
      goto exf;

